---
kind: property
id: P:Autodesk.Revit.DB.ConnectorElement.Direction
source: html/c9150cc0-7df3-5f6a-7f5d-57ad1518bcd6.htm
---
# Autodesk.Revit.DB.ConnectorElement.Direction Property

Gets the direction of the connector element.

## Syntax (C#)
```csharp
public XYZ Direction { get; }
```